Model: AudioModel
Input Size: (1, 128, 128)

--------------------------------------------------------------------------------
Layer (type)               Output Shape         Param #
================================================================================
Conv2d-0                  [-1, 16, 128, 128]   160
ReLU-1                    [-1, 16, 128, 128]   0
MaxPool2d-2               [-1, 16, 64, 64]     0
Conv2d-3                  [-1, 32, 64, 64]     4,640
ReLU-4                    [-1, 32, 64, 64]     0
MaxPool2d-5               [-1, 32, 32, 32]     0
Conv2d-6                  [-1, 64, 32, 32]     18,496
ReLU-7                    [-1, 64, 32, 32]     0
MaxPool2d-8               [-1, 64, 16, 16]     0
LSTM-lstm                 [-1, 128]            590,336
Linear-emotion_fc         [-1, 7]              903
Linear-feature_fc         [-1, 128]            16,512
================================================================================
Total params: 631,047
Trainable params: 631,047
Non-trainable params: 0
--------------------------------------------------------------------------------