Model: ImageModel
Input Size: (3, 224, 224)

--------------------------------------------------------------------------------
Layer (type)               Output Shape         Param #
================================================================================
Conv2d-0                  [-1, 64, 112, 112]   9,408
BatchNorm2d-1             [-1, 64, 112, 112]   128
ReLU-2                    [-1, 64, 112, 112]   0
MaxPool2d-3               [-1, 64, 56, 56]     0
Sequential-4              [-1, 64, 56, 56]     147,968
BasicBlock-0              [-1, 64, 112, 112]   73,984
Conv2d-conv1              [-1, 64, 112, 112]   36,864
BatchNorm2d-bn1           [-1, 64, 112, 112]   128
ReLU-relu                 [-1, 64, 112, 112]   0
Conv2d-conv2              [-1, 64, 112, 112]   36,864
BatchNorm2d-bn2           [-1, 64, 112, 112]   128
BasicBlock-1              [-1, 64, 112, 112]   73,984
Conv2d-conv1              [-1, 64, 112, 112]   36,864
BatchNorm2d-bn1           [-1, 64, 112, 112]   128
ReLU-relu                 [-1, 64, 112, 112]   0
Conv2d-conv2              [-1, 64, 112, 112]   36,864
BatchNorm2d-bn2           [-1, 64, 112, 112]   128
Sequential-5              [-1, 128, 28, 28]    525,568
BasicBlock-0              [-1, 64, 112, 112]   230,144
Conv2d-conv1              [-1, 64, 112, 112]   73,728
BatchNorm2d-bn1           [-1, 64, 112, 112]   256
ReLU-relu                 [-1, 64, 112, 112]   0
Conv2d-conv2              [-1, 64, 112, 112]   147,456
BatchNorm2d-bn2           [-1, 64, 112, 112]   256
Sequential-downsample     [-1, 64, 112, 112]   8,448
Conv2d-0                  [-1, 64, 112, 112]   8,192
BatchNorm2d-1             [-1, 64, 112, 112]   256
BasicBlock-1              [-1, 64, 112, 112]   295,424
Conv2d-conv1              [-1, 64, 112, 112]   147,456
BatchNorm2d-bn1           [-1, 64, 112, 112]   256
ReLU-relu                 [-1, 64, 112, 112]   0
Conv2d-conv2              [-1, 64, 112, 112]   147,456
BatchNorm2d-bn2           [-1, 64, 112, 112]   256
Sequential-6              [-1, 256, 14, 14]    2,099,712
BasicBlock-0              [-1, 64, 112, 112]   919,040
Conv2d-conv1              [-1, 64, 112, 112]   294,912
BatchNorm2d-bn1           [-1, 64, 112, 112]   512
ReLU-relu                 [-1, 64, 112, 112]   0
Conv2d-conv2              [-1, 64, 112, 112]   589,824
BatchNorm2d-bn2           [-1, 64, 112, 112]   512
Sequential-downsample     [-1, 64, 112, 112]   33,280
Conv2d-0                  [-1, 64, 112, 112]   32,768
BatchNorm2d-1             [-1, 64, 112, 112]   512
BasicBlock-1              [-1, 64, 112, 112]   1,180,672
Conv2d-conv1              [-1, 64, 112, 112]   589,824
BatchNorm2d-bn1           [-1, 64, 112, 112]   512
ReLU-relu                 [-1, 64, 112, 112]   0
Conv2d-conv2              [-1, 64, 112, 112]   589,824
BatchNorm2d-bn2           [-1, 64, 112, 112]   512
Sequential-7              [-1, 512, 7, 7]      8,393,728
BasicBlock-0              [-1, 64, 112, 112]   3,673,088
Conv2d-conv1              [-1, 64, 112, 112]   1,179,648
BatchNorm2d-bn1           [-1, 64, 112, 112]   1,024
ReLU-relu                 [-1, 64, 112, 112]   0
Conv2d-conv2              [-1, 64, 112, 112]   2,359,296
BatchNorm2d-bn2           [-1, 64, 112, 112]   1,024
Sequential-downsample     [-1, 64, 112, 112]   132,096
Conv2d-0                  [-1, 64, 112, 112]   131,072
BatchNorm2d-1             [-1, 64, 112, 112]   1,024
BasicBlock-1              [-1, 64, 112, 112]   4,720,640
Conv2d-conv1              [-1, 64, 112, 112]   2,359,296
BatchNorm2d-bn1           [-1, 64, 112, 112]   1,024
ReLU-relu                 [-1, 64, 112, 112]   0
Conv2d-conv2              [-1, 64, 112, 112]   2,359,296
BatchNorm2d-bn2           [-1, 64, 112, 112]   1,024
Linear-emotion_fc         [-1, 7]              3,591
Linear-feature_fc         [-1, 128]            65,664
================================================================================
Total params: 33,753,543
Trainable params: 33,753,543
Non-trainable params: 0
--------------------------------------------------------------------------------